/*Цель - написать консольное меню.
Написать 3 класса (Меню, Категория. Болюдо)
Меню состоит из категорий (прим. Завтраки Первые Бар и т д)
Категории содержат блюда
Блюдо имеет название, описание, состав, цену.


В категорию можно добавить блюдо и удалить.
У каждой категории есть метод, выводящий в консоль ее содержимое.
Так же можете добавлять что то от себя(к примеру посчитать сумму всех блюд в категории, изменить блюдо и т д)


Как все это реализовать - на ваше усмотрение. Стогих правил нет. Глевное что бы работало )
Работу запушить в свой git hрепозиторий. Теперь все домашки будем записывать в гит.*/

class Menu{

}
class Category {

}
class Dish {
    
}